<h1 align="center"> Introduction</h1>

<p> Use all the files to have a final datasets to have the following columns </p>
 <ul>
    <li>questid</li>
    <li>gender</li>
    <li>age (age of applicant)</li>
    <li>communeName (use data prep in commune file)</li>
    <li>application_date (created at in quest file)</li>
    <li>enroll_date (created_at in enroll file)</li>
    <li>is_enroll (Yes/No) (use data prep in enroll file)</li>
    <li>Education Level</li>
    <li>Communication channels(hear_AA1)</li>
    <li>Bootcamp Insterest (after_AA)</li>
    <li>Payement Date (use ord and transaction files)</li>
    <li>Payed (Yes/No)</li>
    <li>list Technologies as columns based (use get_dummies)</li>
    <li>list  Study domains (use get_dummies)</li>
    <li>Job is formal</li>
    <li>Have computer at home</li>
    <li>Have internet at home</li>
 </ul>
 
 <br>

<h1 align="center"> Project Setup </h1>

#### 1. Install all requirements for the project

In [146]:
# !pip install numpy
# !pip install pandas
# !pip install matplotlib
# !pip install seaborn

#### 2. Importing Dependencies

In [147]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import sys

#### 3. Define some usefull variables

In [148]:
DOCS_PATH = 'docs/'
DATA_PATH = 'data/'

#### 4. Importing Datasets

In [149]:
commune_df = pd.read_excel((DATA_PATH + "commune.xlsx"))
enroll_df = pd.read_csv(DATA_PATH + "enroll.csv")
industry_df = pd.read_csv(DATA_PATH + "industry.csv")
ord_df = pd.read_csv(DATA_PATH + "ord.csv")
quest_df = pd.read_csv(DATA_PATH + "quest.csv")
studyd_df = pd.read_csv(DATA_PATH + "study_domain.csv")
tech_df = pd.read_csv(DATA_PATH + "technology.csv")
transaction_df = pd.read_csv(DATA_PATH + "transaction.csv")

<br><br>

<h1 align="center"> Data Processing </h1>

### 1. Commune Dataset

>#### Data Overview

In [150]:
# Displaying first two entries of the Commune dataset using DataFrame.head()
commune_df.head(2)

     Commune_en    Commune_FR Commune_Id  Departement ADM1_PCODE
0      Abricots      Abricots     HT0812  Grande'Anse       HT08
1  Acul du Nord  Acul du Nord     HT0321        North       HT03

In [151]:
# Check the dimensions of the DataFrame
row, col = commune_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 140 rows and 5 columns

In [152]:
# Data Types
commune_df.dtypes

Commune_en     object
Commune_FR     object
Commune_Id     object
Departement    object
ADM1_PCODE     object
dtype: object

In [153]:
# Data info
commune_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Commune_en   140 non-null    object
 1   Commune_FR   140 non-null    object
 2   Commune_Id   140 non-null    object
 3   Departement  140 non-null    object
 4   ADM1_PCODE   140 non-null    object
dtypes: object(5)
memory usage: 5.6+ KB

In [154]:
# Describe the dataset
commune_df.describe()

       Commune_en Commune_FR Commune_Id Departement ADM1_PCODE
count         140        140        140         140        140
unique        140        140        140          10         10
top     Miragoane  Vallières     HT0313        West       HT01
freq            1          1          1          20         20

In [155]:
# Make sure our columns don't have duplicate values.
commune_df.duplicated().sum()

0

In [156]:
# Make sure our columns don't have missing values.
commune_df.isna().sum()

Commune_en     0
Commune_FR     0
Commune_Id     0
Departement    0
ADM1_PCODE     0
dtype: int64

>#### Data Cleaning

In [157]:
# Drop all columns we will not use in this dataset
to_drop = ['Commune_FR','Departement','ADM1_PCODE']
clean_commune_df = commune_df.drop(to_drop, axis = 1)

In [158]:
# Displaying our clean dataset
clean_commune_df.head(3)

      Commune_en Commune_Id
0       Abricots     HT0812
1   Acul du Nord     HT0321
2  Anse-a-Foleur     HT0922

### 2. Enroll Dataset

>##### Data Overview

In [159]:
# Displaying last entry of Enroll dataset
enroll_df.tail(1)

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
147,147,2021-03-14T17:34:44.861Z,2071-03-02T17:34:52.000Z,41592698,Entwodiksyon Nan Syans Done,1047613,0.046512,NaN,False,False,False,2021-03-14T17:36:13.505Z,2021-03-14T17:34:44.000Z,2021-03-14T17:39:40.547Z,NaN

In [160]:
# Check the dimensions of the DataFrame
row, col = enroll_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 148 rows and 15 columns

In [161]:
# Data Types
enroll_df.dtypes

Unnamed: 0                int64
created_at               object
expiry_date              object
user_id                   int64
course_name              object
course_id                 int64
percentage_completed    float64
completed_at            float64
expired                    bool
is_free_trial              bool
completed                  bool
started_at               object
activated_at             object
updated_at               object
quest_id                 object
dtype: object

In [162]:
# Data info
enroll_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            148 non-null    int64
 1   created_at            148 non-null    object
 2   expiry_date           60 non-null     object
 3   user_id               148 non-null    int64
 4   course_name           148 non-null    object
 5   course_id             148 non-null    int64
 6   percentage_completed  148 non-null    float64
 7   completed_at          0 non-null      float64
 8   expired               148 non-null    bool
 9   is_free_trial         148 non-null    bool
 10  completed             148 non-null    bool
 11  started_at            135 non-null    object
 12  activated_at          77 non-null     object
 13  updated_at            148 non-null    object
 14  quest_id              102 non-null    object
dtypes: bool(3), float64(2), int64(3), object(7)
memory usage: 14.4+ KB

In [163]:
# Describe the dataset
enroll_df.describe()

       Unnamed: 0       user_id  course_id  percentage_completed  completed_at
count  148.000000  1.480000e+02      148.0            148.000000           0.0
mean    73.500000  3.982423e+07  1047613.0              0.249925           NaN
std     42.868014  1.782956e+06        0.0              0.313651           NaN
min      0.000000  2.981617e+07  1047613.0              0.000000           NaN
25%     36.750000  3.989802e+07  1047613.0              0.000000           NaN
50%     73.500000  4.009749e+07  1047613.0              0.023810           NaN
75%    110.250000  4.062487e+07  1047613.0              0.418605           NaN
max    147.000000  4.159270e+07  1047613.0              0.953488           NaN

In [164]:
# Make sure our columns don't have duplicate values
print("This dataframe have", enroll_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [165]:
# Check if we have missing values in our columns
print("This dataframe have", enroll_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0                0
created_at                0
expiry_date              88
user_id                   0
course_name               0
course_id                 0
percentage_completed      0
completed_at            148
expired                   0
is_free_trial             0
completed                 0
started_at               13
activated_at             71
updated_at                0
quest_id                 46
dtype: int64 missing values

In [166]:
# How many missing values we have
print("This dataframe have", enroll_df.isna().sum().sum(), "missing values")

This dataframe have 366 missing values

>##### Data Cleaning

In [167]:
# Dealing with our missing values
clean_enroll_df = enroll_df.fillna(value = 0)
print("We now have", clean_enroll_df.isnull().sum().sum(), "missing value")

We now have 0 missing value

In [212]:
clean_enroll_df.columns

Index(['Unnamed: 0', 'created_at', 'expiry_date', 'user_id', 'course_name',
       'course_id', 'percentage_completed', 'completed_at', 'expired',
       'is_free_trial', 'completed', 'started_at', 'activated_at',
       'updated_at', 'quest_id'],
      dtype='object')

In [ ]:
# Create a new data frame with specific selected columns
final_enroll_df = clean_enroll_df.loc[['created_at','quest_id','completed_at']]

In [168]:
# Our cleaned Dataframe
clean_enroll_df.head(2)

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,0,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,0.0,False,True,False,0,0,2020-12-12T06:41:29.844Z,0
1,1,2020-12-13T14:41:17.720Z,0,35229766,Entwodiksyon Nan Syans Done,1047613,0.0,0.0,False,True,False,0,0,2020-12-13T14:41:17.720Z,0

### 3. Industry Dataset

>##### Data Overview

In [169]:
# Displaying first two entries of the industry dataset
industry_df.head(2)

,Unnamed: 0,key,values,quest_id
0,0,item1,Finance,905ddcf2-ce95-11eb-9a92-7c67a234f601
1,1,item6,Technology (Software/ Internet),905e2608-ce95-11eb-809f-7c67a234f601

In [170]:
# Check the dimensions of the DataFrame
row, col = industry_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 807 rows and 4 columns

In [171]:
# Data info
industry_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 807 entries, 0 to 806
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  807 non-null    int64
 1   key         807 non-null    object
 2   values      807 non-null    object
 3   quest_id    807 non-null    object
dtypes: int64(1), object(3)
memory usage: 25.3+ KB

In [172]:
# Describe the dataset
industry_df.describe()

       Unnamed: 0
count  807.000000
mean   403.000000
std    233.105126
min      0.000000
25%    201.500000
50%    403.000000
75%    604.500000
max    806.000000

In [173]:
# Duplicated rows
print(industry_df.duplicated().sum(), "Duplicated rows")

0 Duplicated rows

In [174]:
# Make sure our columns don't have missing values.
industry_df.isna().sum()

Unnamed: 0    0
key           0
values        0
quest_id      0
dtype: int64

>##### Data Overview

### 4. Ord Dataset

>##### Data Overview

In [175]:
# Displaying first entry
ord_df.head(1)

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601

In [176]:
# Check the dimensions of the DataFrame
row, col = ord_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 18 rows and 13 columns

In [177]:
# Data Types
ord_df.dtypes

Unnamed: 0                   int64
created_at                  object
user_id                      int64
product_name                object
product_id                   int64
amount_dollars               int64
amount_cents                 int64
subscription                  bool
coupon_code                 object
coupon_id                  float64
affiliate_referral_code    float64
status                      object
quest_id                    object
dtype: object

In [178]:
# Data info
ord_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               18 non-null     int64
 1   created_at               18 non-null     object
 2   user_id                  18 non-null     int64
 3   product_name             18 non-null     object
 4   product_id               18 non-null     int64
 5   amount_dollars           18 non-null     int64
 6   amount_cents             18 non-null     int64
 7   subscription             18 non-null     bool
 8   coupon_code              4 non-null      object
 9   coupon_id                4 non-null      float64
 10  affiliate_referral_code  0 non-null      float64
 11  status                   18 non-null     object
 12  quest_id                 14 non-null     object
dtypes: bool(1), float64(2), int64(5), object(5)
memory usage: 1.8+ KB

In [179]:
# Describe the dataset
ord_df.describe()

,Unnamed: 0,user_id,product_id,amount_dollars,amount_cents,coupon_id,affiliate_referral_code
count,18.000000,1.800000e+01,18.0,18.000000,18.000000,4.000000e+00,0.0
mean,8.500000,3.978105e+07,1100636.0,15.555556,1555.555556,6.535246e+06,NaN
std,5.338539,1.879479e+06,0.0,8.555853,855.585264,8.718553e+04,NaN
min,0.000000,3.485615e+07,1100636.0,0.000000,0.000000,6.452874e+06,NaN
25%,4.250000,3.989797e+07,1100636.0,20.000000,2000.000000,6.498275e+06,NaN
50%,8.500000,4.020500e+07,1100636.0,20.000000,2000.000000,6.514828e+06,NaN
75%,12.750000,4.038378e+07,1100636.0,20.000000,2000.000000,6.551799e+06,NaN
max,17.000000,4.158795e+07,1100636.0,20.000000,2000.000000,6.658457e+06,NaN

In [180]:
# Make sure our columns don't have duplicate values
print("This dataframe have", ord_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [181]:
# Check if we have missing values in our columns
print("This dataframe have", ord_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0                  0
created_at                  0
user_id                     0
product_name                0
product_id                  0
amount_dollars              0
amount_cents                0
subscription                0
coupon_code                14
coupon_id                  14
affiliate_referral_code    18
status                      0
quest_id                    4
dtype: int64 missing values

In [182]:
# How many missing values we have
print("This dataframe have", ord_df.isna().sum().sum(), "missing values")

This dataframe have 50 missing values

>##### Data Cleaning

In [183]:
# Dealing with our missing values
clean_ord_df = ord_df.fillna({'quest_id':'unset'}).fillna(0)
print("We now have", clean_ord_df.isnull().sum().sum(), "missing value")

We now have 0 missing value

In [184]:
# Our cleaned Dataframe
clean_ord_df.head(2)

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,0,0.0,0.0,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601
1,1,2021-03-14T04:20:23.483Z,41564742,Entwodiksyon Nan Syans Done,1100636,20,2000,False,0,0.0,0.0,Complete,906636cf-ce95-11eb-8679-7c67a234f601

### 5. Questions Dataset

>##### Data Overview

In [185]:
# Displaying first entries
quest_df.head(2)

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,NaN,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601

In [186]:
# Check the dimensions of the DataFrame
row, col = quest_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 250 rows and 17 columns

In [187]:
# Data Types
quest_df.dtypes

Unnamed: 0             int64
gender                object
dob                   object
commune               object
created_at            object
modified_at           object
department            object
education_level       object
university            object
study_domain          object
current_employed      object
formal_sector_job     object
have_computer_home    object
internet_at_home      object
hear_AA_1             object
after_AA              object
quest_id              object
dtype: object

In [188]:
# Data info
quest_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          250 non-null    int64
 1   gender              250 non-null    object
 2   dob                 244 non-null    object
 3   commune             250 non-null    object
 4   created_at          250 non-null    object
 5   modified_at         250 non-null    object
 6   department          249 non-null    object
 7   education_level     250 non-null    object
 8   university          250 non-null    object
 9   study_domain        250 non-null    object
 10  current_employed    250 non-null    object
 11  formal_sector_job   250 non-null    object
 12  have_computer_home  250 non-null    object
 13  internet_at_home    250 non-null    object
 14  hear_AA_1           250 non-null    object
 15  after_AA            250 non-null    object
 16  quest_id            250 non-null    object
dtypes: int64(1), object(16)
memory usage: 33.3+ KB

In [189]:
# Finding duplicated rows
print(quest_df.duplicated().sum(),"duplicated rows")

0 duplicated rows

In [190]:
# Check if we have missing values in our columns
print("This dataframe have", quest_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0            0
gender                0
dob                   6
commune               0
created_at            0
modified_at           0
department            1
education_level       0
university            0
study_domain          0
current_employed      0
formal_sector_job     0
have_computer_home    0
internet_at_home      0
hear_AA_1             0
after_AA              0
quest_id              0
dtype: int64 missing values

In [191]:
# How many missing values we have
print("This dataframe have", quest_df.isna().sum().sum(), "missing values")

This dataframe have 7 missing values

>##### Data Cleaning

In [192]:
# Dealing with our missing values
clean_quest_df = quest_df.fillna({'dob':'not specified', 'department':'unset'})
print("We now have", clean_quest_df.isnull().sum().sum(), "missing value")

We now have 0 missing value

In [193]:
# Display our cleaned dataframe
clean_quest_df.head(3)

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,unset,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601
2,2,male,17/05/1996,ht0111,2021-02-16T16:56:30.579504Z,2021-02-16T16:56:30.579563Z,ht01,Bachelors (bacc +4),Université d'Etat d'Haïti (UEH),[],No,unknown,Yes,Yes,Friend,Improving my data analysis skills,905e2608-ce95-11eb-809f-7c67a234f601

### 6. Study Domain Dataset

>##### Data Overview

In [194]:
# Displaying latest entries of the dataset
studyd_df.tail()

     Unnamed: 0    key            values                              quest_id
282         282  other             other  906b3c84-ce95-11eb-8c2a-7c67a234f601
283         283  item8          Medicine  906b3c85-ce95-11eb-9b87-7c67a234f601
284         284  item2        Statistics  906b3c86-ce95-11eb-b6a7-7c67a234f601
285         285  item1  Computer Science  906b65e2-ce95-11eb-8b5c-7c67a234f601
286         286  other             other  906b65e3-ce95-11eb-a294-7c67a234f601

In [195]:
# Check the dimensions of the DataFrame
row, col = studyd_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 287 rows and 4 columns

In [196]:
# Data info
studyd_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 287 entries, 0 to 286
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  287 non-null    int64
 1   key         287 non-null    object
 2   values      287 non-null    object
 3   quest_id    287 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.1+ KB

In [197]:
# Make sure our columns don't have duplicate values
print("This dataframe have", studyd_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [198]:
# Check if we have missing values in our columns
print("This dataframe have", studyd_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0    0
key           0
values        0
quest_id      0
dtype: int64 missing values

**Conclusion:** just checking that there are no missing and duplicated values in the study domain dataset...

>##### Data Cleaning

### 7. Tech Dataset

>##### Data Overview

In [199]:
# Displaying first entries
tech_df.head()

   Unnamed: 0     key      values                              quest_id
0           0   item1           R  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item11       Excel  905ddcf2-ce95-11eb-9a92-7c67a234f601
2           2   item2      Python  905e2608-ce95-11eb-809f-7c67a234f601
3           3   item3        Java  905e2608-ce95-11eb-809f-7c67a234f601
4           4   item4  JavaScript  905e2608-ce95-11eb-809f-7c67a234f601

In [200]:
# Check the dimensions of the DataFrame
row, col = tech_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 678 rows and 4 columns

In [201]:
# Data info
tech_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678 entries, 0 to 677
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  678 non-null    int64
 1   key         678 non-null    object
 2   values      678 non-null    object
 3   quest_id    678 non-null    object
dtypes: int64(1), object(3)
memory usage: 21.3+ KB

In [202]:
# Looking for duplicated values
print("This dataframe have", tech_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [203]:
# Check if we have missing values in our columns
print("This dataframe have", tech_df.isna().sum(), "missing values")

This dataframe have Unnamed: 0    0
key           0
values        0
quest_id      0
dtype: int64 missing values

>##### Data Cleaning

### 8. Transaction Dataset

>##### Data Overview

In [204]:
# Displaying first three entries
transaction_df.head(3)

,Unnamed: 0,created_at,modified_at,user_id,course_id,transaction_id
0,0,2021-03-08T05:08:50.832Z,2021-03-08T05:08:50.832Z,40976440,1047613,4641281952
1,1,2021-03-08T17:26:35.841Z,2021-03-08T17:26:35.841Z,41179271,1047613,4644270160
2,2,2021-03-08T18:52:09.147Z,2021-03-08T18:52:09.147Z,40973512,1047613,4645070622

In [205]:
# Check the dimensions of the DataFrame
row, col = transaction_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 60 rows and 6 columns

In [206]:
# Data info
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      60 non-null     int64
 1   created_at      60 non-null     object
 2   modified_at     60 non-null     object
 3   user_id         60 non-null     int64
 4   course_id       60 non-null     int64
 5   transaction_id  60 non-null     int64
dtypes: int64(4), object(2)
memory usage: 2.9+ KB

In [207]:
# Looking for duplicated values
print("This dataframe have", transaction_df.duplicated().sum(), "Duplicated value")

This dataframe have 0 Duplicated value

In [208]:
# Check if we have missing values in our columns
print("This dataframe have", transaction_df.isna().sum().sum(), "missing values")

This dataframe have 0 missing values

<br>
<h2 align=center> Final Dataset </h2>

In [209]:
# Merge all of our dataset to have the final dataset